{
  "id": "brave_rabbit_202",
  "title": "The Brave Little Rabbit",
  "author": "Emma Hopper",
  "year": 2025,
  "coverImage": "https://kjhbest.github.io/TalkXGame/Image_00019_.png",
  "rating": 4.6,
  "category": "adventure",
  "ageGroup": "4-7",
  "likes": 1500,
  "contents": [
    {
      "content": "In a meadow surrounded by tall grass, there lived a little rabbit named Pip. Pip was smaller than all the other rabbits, but he had the biggest heart.",
      "image_url": "https://picsum.photos/id/51/800/600"
    },
    {
      "content": "The other rabbits would sometimes laugh at Pip because he was so small. 'You can't even hop over the smallest stream,' they would say. But Pip didn't mind. He knew that being small had its advantages.",
      "image_url": "https://picsum.photos/id/52/800/600"
    },
    {
      "content": "One day, dark clouds gathered over the meadow. Rain poured down, and the gentle stream turned into a rushing river. All the animals ran to find shelter.",
      "image_url": "https://picsum.photos/id/53/800/600"
    },
    {
      "content": "Pip was about to hide in his burrow when he heard a cry for help. A baby bird had fallen from its nest and was now trapped on a small island in the middle of the rising river.",
      "image_url": "https://picsum.photos/id/54/800/600"
    },
    {
      "content": "The other rabbits were too afraid to help. 'The current is too strong,' they said. 'And you're too small to do anything,' they told Pip.",
      "image_url": "https://picsum.photos/id/55/800/600"
    },
    {
      "content": "But Pip had an idea. He found a large leaf and carefully bit off the stem. Then, he pushed the leaf into the water like a tiny boat and jumped aboard.",
      "image_url": "https://picsum.photos/id/56/800/600"
    },
    {
      "content": "Because Pip was so light, the leaf stayed afloat. He used his little paws to paddle across the rushing water until he reached the baby bird.",
      "image_url": "https://picsum.photos/id/57/800/600"
    },
    {
      "content": "Pip helped the bird onto the leaf boat, and together they made it safely back to shore. The bird's mother was overjoyed, and all the animals in the meadow cheered for the brave little rabbit.",
      "image_url": "https://picsum.photos/id/58/800/600"
    },
    {
      "content": "From that day on, no one in the meadow ever teased Pip about his size again. They knew that true bravery comes from the heart, not from how big you are.",
      "image_url": "https://picsum.photos/id/59/800/600"
    }
  ]
}
